"""
№283. К.Ю. Поляков.
На числовой прямой даны отрезки A = [80; 90], B = [30; 50] и C = [10; N] и функция
            F(x) = (¬(x ∈ A) -> (x ∈ B)) && (¬(x ∈ C) -> (x ∈ A))
При каком наименьшем числе N функция F(x) истинна более чем для 25 целых чисел x?
"""

a = {i for i in range(80, 91)}
b = {i for i in range(30, 51)}
c = set()

for n in range(100):
    c.add(n)
    if (len(a) + len(b & c)) > 25:
        print(n)
        break